users/will/programs/emacs/config.org
#+TITLE: Will's Emacs Config
#+AUTHOR: Will
#+STARTUP: showeverything
#+OPTIONS: toc:2
#+PROPERTY: header-args:emacs-lisp :tangle yes

* TABLE OF CONTENTS :toc:
- [[#packages][Packages]]
  - [[#general-keybindings][General Keybindings]]
  - [[#org][Org]]
  - [[#diary][Diary]]
  - [[#latex][LaTeX]]
  - [[#lilypond][Lilypond]]
  - [[#which-key][Which-key]]
  - [[#ui-packages][UI packages]]
  - [[#better-completions][Better completions]]
  - [[#better-searching][Better searching]]
  - [[#embark][Embark]]
  - [[#avy][Avy]]
  - [[#better-undo][Better undo]]
  - [[#magit][Magit]]
  - [[#dired][Dired]]
  - [[#spellcheck][Spellcheck]]
  - [[#openwith][Openwith]]
  - [[#aggressive-indent][Aggressive indent]]
  - [[#programming-languages][Programming languages]]
- [[#base-settings][Base settings]]
  - [[#fonts][Fonts]]
  - [[#ui][UI]]
  - [[#execute-when-using-daemon][Execute when using daemon]]
  - [[#backups][Backups]]
  - [[#autosaves][Autosaves]]
  - [[#reload-files-on-change][Reload files on change]]
  - [[#ibuffer][IBuffer]]
- [[#my-modes][My modes]]
  - [[#tab-out-mode][Tab out mode]]
- [[#tangle-on-save][Tangle on save]]

* Packages
** General Keybindings
#+begin_src emacs-lisp
  (use-package general
    :ensure t)
#+end_src

*** Global keys
#+begin_src emacs-lisp
  (general-def
    ;; Consult
    "C-s" 'consult-line
    "C-x b" 'consult-buffer
    "M-g M-g" 'consult-goto-line
    "M-g g" 'consult-goto-line
    "M-s f" 'consult-find
    "M-s r" 'consult-ripgrep
    ;; Helpful
    [remap describe-function] 'helpful-function
    [remap describe-symbol] 'helpful-symbol
    [remap describe-command] 'helpful-command
    [remap descrive-variable] 'helpful-variable
    [remap describe-key] 'helpful-key
    ;; IBuffer
    "C-x C-b" 'ibuffer
    ;; Embark
    "C-." 'embark-act
    ;; Avy
    "M-j" 'avy-goto-char-timer
    ;; Org capture
    "C-c c" 'org-capture
    ;; Org agenda
    "C-c a" 'org-agenda-list)
#+end_src

*** Minibuffer keys
#+begin_src emacs-lisp
  (general-def minibuffer-local-map
    "M-h" 'backward-kill-word
    ;; Consult
    "C-r" 'consult-history)
#+end_src

*** Remap to use dired-single
# #+begin_src emacs-lisp
#   (general-def dired-mode-map
#     [remap dired-find-file] 'dired-single-buffer
#     [remap dired-mouse-find-file-other-window] 'dired-single-buffer-mouse
#     [remap dired-up-directory] 'dired-single-up-directory)
# #+end_src

*** Company
#+begin_src emacs-lisp
  (general-def company-active-map
    "C-n" 'company-select-next
    "C-p" 'company-select-previous
    "M-<" 'company-select-first
    "M->" 'company-select-last
    "TAB" 'company-complete)
#+end_src

** Org
*** Src code blocks with tempo
| Typing the below + TAB | Expands to...              |
| <a                     | '#+begin_export ascii' ... |
| <c                     | '#+begin_center' ...       |
| <C                     | '#+begin_comment' ...      |
| <e                     | '#+begin_example' ...      |
| <E                     | '#+begin_export' ...       |
| <h                     | '#+begin_export html' ...  |
| <l                     | '#+begin_export latex' ... |
| <q                     | '#+begin_quote' ...        |
| <s                     | '#+begin_src' ...          |
| <v                     | '#+begin_verse' ...        |

#+begin_src emacs-lisp
  (require 'org-tempo)
#+end_src

*** Table of contents 

#+begin_src emacs-lisp
  (use-package toc-org
    :ensure t
    :commands toc-org-enable
    :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

*** Bullets

#+begin_src emacs-lisp
  (add-hook 'org-mode-hook 'org-indent-mode)
  (use-package org-bullets
    :ensure t
    :init (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
#+end_src

*** Todo
#+begin_src emacs-lisp
  (setq org-todo-keywords
        '((sequence "TODO" "|" "DONE")))
#+end_src

*** Agenda (Super agenda)
#+begin_src emacs-lisp
  (setq org-directory "~/Documents/Planning"
        org-agenda-files 
        (directory-files-recursively "~/Documents/Planning/Agenda" "\\.org$"))

  (use-package org-super-agenda
    :ensure t
    :init (org-super-agenda-mode))

  (setq org-super-agenda-groups
        '((:name "Today"
                 :time-grid t
                 :todo "TODAY")))
#+end_src

*** Capture
#+begin_src emacs-lisp
  (use-package doct
    :ensure t)

  (setq org-capture-templates
        (doct '(("Tasks" :keys "t"
                 :file "~/Documents/Planning/Agenda/Agenda.org"
                 :prepend t
                 :template ("* %{todo-state} %^{Description}"
                            "%^{Schedule||SCHEDULED:|DEADLINE:} %^t"
                            ":PROPERTIES:"
                            ":Created: %U"
                            ":LINK: %a"
                            ":END:"
                            "%?")
                 :children (("Task" :keys "t"
                             :headline "General"
                             :todo-state "TODO")
                            ("School" :keys "s"
                             :headline "School"
                             :todo-state "TODO")
                            )))))
#+end_src

** Diary
#+begin_src emacs-lisp
  (setq diary-file "~/Documents/Planning/diary")
#+end_src

** LaTeX
*** AucTeX
#+begin_src emacs-lisp
  (load "auctex.el" nil t t)
  (load "preview-latex.el" nil t t)

  (setq TeX-auto-save t
        TeX-parse-self t
        TeX-electric-math (cons "$" "$")
        LaTeX-electric-left-right-brace t
        TeX-electric-sub-and-superscript t
        LaTeX-math-menu-unicode t
        TeX-insert-macro-default-style 'show-optional-args)
  (add-hook 'LaTeX-mod-hook 'LaTeX-math-mode)
  (add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer)
#+end_src

*** RefTeX
#+begin_src emacs-lisp
  (add-hook 'LaTeX-mode-hook 'turn-on-reftex)
  (setq reftex-plug-into-AUCTex t)
#+end_src

** Lilypond
#+begin_src emacs-lisp
  (require 'lilypond-mode)

  (use-package LilyPond-mode
    :mode "\\.ly\\'"
    :config
    (setq LilyPond-pdf-command "zathura"))
#+end_src

** Which-key

#+begin_src emacs-lisp
  (use-package which-key
    :ensure t
    :init (which-key-mode 1)
    :config
    (setq which-key-idle-delay 0.5))
#+end_src

** UI packages

*** Doom themes

#+begin_src emacs-lisp
  ;; (use-package doom-themes
  ;;   :ensure t
  ;;   :config
  ;;   (setq doom-themes-enable-bold t
  ;;         doom-themes-enable-italic t)
  ;;   (load-theme 'doom-solarized-dark t)
  ;;   (doom-themes-visual-bell-config))
#+end_src

*** Doom modeline

#+begin_src emacs-lisp
  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1)
    :config
    (setq doom-modeline-buffer-file-name-style 'truncate-except-project))

  ;; Taken from the doom-modeline FAQ to fix right side cutoff
  (setq nerd-icons-scale-factor 1.1)
#+end_src

*** Icons

#+begin_src emacs-lisp
  (use-package all-the-icons
    :ensure t)
#+end_src

*** Rainbow delimiters

#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :ensure t
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** Better completions
*** Vertico
#+begin_src emacs-lisp
  (use-package vertico
    :ensure t
    :init (vertico-mode)
    :config (setq vertico-cycle t))
#+end_src

*** Save minibuffer history
#+begin_src emacs-lisp
  (use-package savehist
    :init (savehist-mode)
    :config (setq history-length 25))
#+end_src

** Better searching
*** Consult
#+begin_src emacs-lisp
  (use-package consult
    :ensure t)
#+end_src

*** Marginalia
#+begin_src emacs-lisp
  (use-package marginalia
    :ensure t
    :after (vertico)
    :init (marginalia-mode)
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil)))
#+end_src

*** Helpful
#+begin_src emacs-lisp
  (use-package helpful
    :ensure t)
#+end_src

*** Orderless (fuzzy searching)
#+begin_src emacs-lisp
  (use-package orderless
    :ensure t
    :custom
    (completion-styles '(orderless)))
#+end_src

** Embark
#+begin_src emacs-lisp
  (use-package embark
    :ensure t
    :config
    ;; Hide the mode line of the Embark live/completions buffers
    (add-to-list 'display-buffer-alist
                 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                   nil
                   (window-parameters (mode-line-format . none)))))

  (use-package embark-consult
    :ensure t
    :hook (embark-collect-mode . consult-preview-at-point-mode))
#+end_src

