users/will/programs/emacs/config.el
(use-package general
  :ensure t)

(general-def
  ;; Consult
  "C-s" 'consult-line
  "C-x b" 'consult-buffer
  "M-g M-g" 'consult-goto-line
  "M-g g" 'consult-goto-line
  "M-s f" 'consult-find
  "M-s r" 'consult-ripgrep
  ;; Helpful
  [remap describe-function] 'helpful-function
  [remap describe-symbol] 'helpful-symbol
  [remap describe-command] 'helpful-command
  [remap descrive-variable] 'helpful-variable
  [remap describe-key] 'helpful-key
  ;; IBuffer
  "C-x C-b" 'ibuffer
  ;; Embark
  "C-." 'embark-act
  ;; Avy
  "M-j" 'avy-goto-char-timer)

(general-def minibuffer-local-map
  "M-h" 'backward-kill-word
  ;; Consult
  "C-r" 'consult-history)

(general-def dired-mode-map
  [remap dired-find-file] 'dired-single-buffer
  [remap dired-mouse-find-file-other-window] 'dired-single-buffer-mouse
  [remap dired-up-directory] 'dired-single-up-directory)

(general-def company-active-map
  "C-n" 'company-select-next
  "C-p" 'company-select-previous
  "M-<" 'company-select-first
  "M->" 'company-select-last
  "TAB" 'company-complete)

(require 'org-tempo)

(use-package toc-org
  :ensure t
  :commands toc-org-enable
  :init (add-hook 'org-mode-hook 'toc-org-enable))

(add-hook 'org-mode-hook 'org-indent-mode)
(use-package org-bullets
  :ensure t
  :init (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))

(setq org-todo-keywords
      '((sequence "TODO" "TODAY" "|" "DONE")))

(setq org-directory "~/Documents/Planning"
      org-agenda-files 
      (directory-files-recursively "~/Documents/Planning/Agenda" "\\.org$"))

(use-package org-super-agenda
  :ensure t
  :init (org-super-agenda-mode))

(setq org-super-agenda-groups
      '((:name "Today"
               :time-grid t
               :todo "TODAY")))

(use-package doct
  :ensure t)

(setq org-capture-templates
      (doct '(("Tasks" :keys "t"
               :file "~/Documents/Planning/Agenda/agenda.org"
               :prepend t
               :template ("* %{todo-state} %^{Description}"
                          "%^{Schedule|SCHEDULED|DEADLINE}: %^t"
                          ":PROPERTIES:"
                          ":Created: %U"
                          ":LINK: %a"
                          ":END:"
                          "%?")
               :children (("Task" :keys "t"
                           :headline "General"
                           :todo-state "TODO")
                          ("School" :keys "s"
                           :headline "School"
                           :todo-state "TODO")
                          )))))

(setq diary-file "~/Documents/Planning/diary")

(load "auctex.el" nil t t)
(load "preview-latex.el" nil t t)

(setq TeX-auto-save t
      TeX-parse-self t
      TeX-electric-math (cons "$" "$")
      LaTeX-electric-left-right-brace t
      TeX-electric-sub-and-superscript t
      LaTeX-math-menu-unicode t
      TeX-insert-macro-default-style 'show-optional-args)
(add-hook 'LaTeX-mod-hook 'LaTeX-math-mode)
(add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer)

(add-hook 'LaTeX-mode-hook 'turn-on-reftex)
(setq reftex-plug-into-AUCTex t)

(require 'lilypond-mode)

(use-package LilyPond-mode
  :mode "\\.ly\\'"
  :config
  (setq LilyPond-pdf-command "zathura"))

(use-package which-key
  :ensure t
  :init (which-key-mode 1)
  :config
  (setq which-key-idle-delay 0.5))

;; (use-package doom-themes
;;   :ensure t
;;   :config
;;   (setq doom-themes-enable-bold t
;;         doom-themes-enable-italic t)
;;   (load-theme 'doom-solarized-dark t)
;;   (doom-themes-visual-bell-config))

(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :config
  (setq doom-modeline-buffer-file-name-style 'truncate-except-project))

;; Taken from the doom-modeline FAQ to fix right side cutoff
(setq nerd-icons-scale-factor 1.1)

(use-package all-the-icons
  :ensure t)

(use-package rainbow-delimiters
  :ensure t
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package vertico
  :ensure t
  :init (vertico-mode)
  :config (setq vertico-cycle t))

(use-package savehist
  :init (savehist-mode)
  :config (setq history-length 25))

(use-package consult
  :ensure t)

(use-package marginalia
  :ensure t
  :after (vertico)
  :init (marginalia-mode)
  :custom
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil)))

(use-package helpful
  :ensure t)

(use-package orderless
  :ensure t
  :custom
  (completion-styles '(orderless)))

(use-package embark
  :ensure t
  :config
  ;; Hide the mode line of the Embark live/completions buffers
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none)))))

(use-package embark-consult
  :ensure t
  :hook (embark-collect-mode . consult-preview-at-point-mode))

(use-package avy
  :ensure t)
