users/will/programs/emacs/config.org
** Avy
#+begin_src emacs-lisp
  (use-package avy
    :ensure t)

  (setq avy-keys '(?q ?e ?r ?y ?u ?o ?p
                      ?a ?s ?d ?f ?g ?h ?j
                      ?k ?l ?' ?x ?c ?v ?b
                      ?n ?, ?/))

  (defun avy-show-dispatch-help ()  
    (let* ((len (length "avy-action-"))
           (fw (frame-width))
           (raw-strings (mapcar
                         (lambda (x)
                           (format "%2s: %-19s"
                                   (propertize
                                    (char-to-string (car x))
                                    'face 'aw-key-face)
                                   (substring (symbol-name (cdr x)) len)))
                         avy-dispatch-alist))
           (max-len (1+ (apply #'max (mapcar #'length raw-strings))))
           (strings-len (length raw-strings))
           (per-row (floor fw max-len))
           display-strings)
      (cl-loop for string in raw-strings
               for N from 1 to strings-len do
               (push (concat string " ") display-strings)
               (when (= (mod N per-row) 0) (push "\n" display-strings)))
      (message "%s" (apply #'concat (nreverse display-strings)))))

  ;; Kill text
  (defun avy-action-kill-whole-line (pt)
    (save-excursion
      (goto-char pt)
      (kill-whole-line))
    (select-window
     (cdr
      (ring-def avy-ring 0)))
    t)

  (setf (alist-get ?k avy-dispatch-alist) 'avy-action-kill-stay
        (alist-get ?K avy-dispatch-alist) 'avy-action-kill-whole-line)

  ;; Copy text
  (defun avy-action-copy-whole-line (pt)
    (save-excursion
      (goto-char pt)
      (cl-destructuring-bind (start . end)
          (bounds-of-thing-at-point 'line)
        (copy-region-as-kill start end)))
    (select-window
     (cdr
      (ring-ref avy-ring 0)))
    t)

  (setf (alist-get ?w avy-dispatch-alist) 'avy-action-copy
        (alist-get ?W avy-dispatch-alist) 'avy-action-copy-whole-line)

  ;; Yank text
  (defun avy-action-yank-whole-line (pt)
    (avy-action-copy-whole-line pt)
    (save-excursion (yank))
    t)

  (setf (alist-get ?y avy-dispatch-alist) 'avy-action-yank
        (alist-get ?Y avy-dispatch-alist) 'avy-action-yank-whole-line)

  ;; Transpose/Move text
  (defun avy-action-teleport-whole-line (pt)
    (avy-action-kill-whole-line pt)
    (save-excursion (yank)) t)

  (setf (alist-get ?t avy-dispatch-alist) 'avy-action-teleport
        (alist-get ?T avy-dispatch-alist) 'avy-action-teleport-whole-line)

  ;; Mark text
  (defun avy-action-mark-to-char (pt)
    (activate-mark)
    (goto-char pt))

  (setf (alist-get ?  avy-dispatch-alist) 'avy-action-mark-to-char)

  ;; Get Elisp Help
  (defun avy-action-helpful (pt)
    (save-excursion
      (goto-char pt)
      (helpful-at-point))
    (select-window
     (cdr (ring-ref avy-ring 0)))
    t)

  (setf (alist-get ?H avy-dispatch-alist) 'avy-action-helpful)

  ;; Embark
  (defun avy-action-embark (pt)
    (unwind-protect
        (save-excursion
          (goto-char pt)
          (embark-act))
      (select-window
       (cdr (ring-ref avy-ring 0))))
    t)

  (setf (alist-get ?. avy-dispatch-alist) 'avy-action-embark)
#+end_src

** Better undo
#+begin_src emacs-lisp
  (use-package undo-fu
    :ensure t)
#+end_src

** Magit
#+begin_src emacs-lisp
  (use-package magit
    :ensure t
    :commands (magit-status magit-get-current-branch)
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
#+end_src

In my previous config, I had the 'ssh-agency' package installed, although it seems this may not be necessary.

** Dired
#+begin_src emacs-lisp
  (use-package dired
    :commands (dired dired-jump)
    :custom (dired-listing-switches "-agho --group-directories-first"))

  ;;(use-package dired-single
  ;;  :ensure t
  ;;  :after (dired))

  (use-package dired-hide-dotfiles
    :ensure t
    :hook (dired-mode . dired-hide-dotfiles-mode))

  (use-package all-the-icons-dired
    :ensure t
    :hook (dired-mode . all-the-icons-dired-mode))

  (setq dired-kill-when-opening-new-dired-buffer 1)
#+end_src

** Spellcheck
#+begin_src emacs-lisp
  (use-package ispell
    :config
    (setq ispell-program-name "aspell"))

  (use-package flycheck
    :ensure t)
#+end_src

** Openwith
#+begin_src emacs-lisp
  (use-package openwith
    :ensure t
    :config
    (when (require 'openwith nil 'noerror)
      (setq openwith-associations
            (list
             (list (openwith-make-extension-regexp
                    '("doc" "xls" "ppt" "odt" "ods" "odg" "odp"))
                   "libreoffice"
                   '(file))
             (list (openwith-make-extension-regexp
                    '("mgp" "mpeg" "mp3" "mp4"
                      "avi" "wmv" "wav" "mov" "flv"
                      "ogn" "ogg" "mkv"))
                   "mpv"
                   '(file))
             (list (openwith-make-extension-regexp
                    '("pdf"))
                   "zathura"
                   '(file))
             (list (openwith-make-extension-regexp
                    '("png" "jpeg" "jpg" "heic"))
                   "nomacs"
                   '(file))))
      (openwith-mode 1)))
#+end_src

** Aggressive indent
#+begin_src emacs-lisp
  (use-package aggressive-indent
    :ensure t
    :init (global-aggressive-indent-mode 1))
#+end_src

** Programming languages

*** Company
#+begin_src emacs-lisp
  (use-package company
    :ensure t
    :config
    (setq company-idle-delay 0
          company-minimum-prefix-length 2)
    (add-hook 'after-init-hook 'global-company-mode))
#+end_src
*** LSP
#+begin_src emacs-lisp
  ;; (use-package eglot
  ;;   :after (direnv)
  ;;   :custom
  ;;   (eglot-autoshutdown t)
  ;;   (eglot-confirm-server-initiated-edits nil))
#+end_src

*** Nix
#+begin_src emacs-lisp
  (use-package nix-mode
    :ensure t
    :mode "\\.nix\\'")

  (use-package nix-flake
    :after (nix-mode))
#+end_src

**** Direnv
#+begin_src emacs-lisp
  (use-package direnv
    :ensure t
    :config (direnv-mode))
#+end_src

*** Haskell
#+begin_src emacs-lisp
  (use-package haskell-mode
    :ensure t)
    ;; :config
    ;; (add-hook 'haskell-mode-hook 'eglot-ensure))
#+end_src

*** Zig
#+begin_src emacs-lisp
  (use-package zig-mode
    :ensure t)
    ;; :config
    ;; (add-hook 'zig-mode-hook 'eglot-ensure))
#+end_src

* Base settings
** Fonts

#+begin_src emacs-lisp
  (defun will/set-font-faces ()
    (message "setting fonts")
    (set-face-attribute 'default nil
			:font "FiraCode Nerd Font Mono"
			:height 110
			:weight 'medium)
    (set-face-attribute 'variable-pitch nil
			:font "TeX Gyre Schola"
			:height 120
			:weight 'medium)
    (set-face-attribute 'fixed-pitch nil
			:font "FiraCode Nerd Font Mono"
			:height 110
			:weight 'medium)
    (set-face-attribute 'font-lock-comment-face nil
			:slant 'italic)
    (set-face-attribute 'font-lock-keyword-face nil
			:slant 'italic))
#+end_src

** UI

#+begin_src emacs-lisp
  ;; Adjust line spacing
  (setq-default line-spacing 0.12)

  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (tooltip-mode -1)

  (set-fringe-mode 10)

  ;; Line numbers and truncation
  (column-number-mode t)
  (global-display-line-numbers-mode 1)
  (global-visual-line-mode 1)

  (setq visible-bell t)

  (electric-indent-mode -1)

  (global-hl-line-mode 1)

  (blink-cursor-mode nil)
#+end_src

*** Modus theme
#+begin_src emacs-lisp
  (setq 
   ;; font options for highlighting
   modus-themes-bold-constructs t
   modus-themes-italic-constructs t

   ;; org settings
   modus-themes-org-blocks 'tinted-background

   ;; headings
   modus-themes-headings 
   '((1 . (1.5))
     (2 . (1.3)))

   ;; modeline
   modus-themes-common-palette-overrides
   '((bg-mode-line-active bg-cyan-intense)
     (fg-mode-line-active fg-main)
     (border-mode-line-active blue-intense)))


  ;; This should be the last line of theme config: set variables first.
  ;(load-theme 'modus-vivendi-deuteranopia t)
  (load-theme 'modus-vivendi t)
#+end_src

** Execute when using daemon

#+begin_src emacs-lisp
  (if (daemonp)
      (add-hook 'after-make-frame-functions
		(lambda (frame)
		  (setq doom-modeline-icon t)
		  (with-selected-frame frame
		    (will/set-font-faces))))
    (will/set-font-faces))
#+end_src

** Backups

#+begin_src emacs-lisp
  (setq backup-directory-alist '(("." . "~/.emacs.d/backup"))
	backup-by-copying t
	version-control t
	delete-old-version t
	kept-new-version 20
	kept-old-version t)
#+end_src

** Autosaves
#+begin_src emacs-lisp
  (setq auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)))
#+end_src

** Reload files on change
#+begin_src emacs-lisp
  (global-auto-revert-mode 1)
  ;; Revert dired
  (setq global-auto-revert-non-file-buffers t)
#+end_src

