users/will/programs/emacs/config.org
** IBuffer
#+begin_src emacs-lisp
  (setq ibuffer-saved-filter-groups
        (quote (("default"
                 ("dired" (mode . dired-mode))
                 ("org" (name . "^.*org$"))
                 ("programming" (or
                                 (mode . haskell-mode)
                                 (mode . nix-mode)))
                 ("magit" (name . "magit*"))
                 ("emacs" (or
                           (name . "^\\*scratch*$")
                           (name . "^\\*Messages\\*$")))))))

  (add-hook 'ibuffer-mode-hook
            (lambda ()
              (ibuffer-auto-mode 1)
              (ibuffer-switch-to-saved-filter-groups "default")))
#+end_src

* My modes
#+begin_src emacs-lisp
  (require 'dash)
#+end_src

** Tab out mode
#+begin_src emacs-lisp
  (defvar-local will/tab-out-delimiters 
      '(";" "(" ")" "[" "]" "{" "}" "|" "'" "\"" "`" "$" "<" ">"))

  (defun will/get-line-from-cursor (arg)
    (interactive "P")
    (let ((not-end-of-line (buffer-substring-no-properties
                            (+ 1 (point))
                            (line-end-position))))
      (if not-end-of-line
          (buffer-substring-no-properties
           (+ 1 (point))
           (line-end-position))
        (buffer-substring-no-properties
         (point)
         (line-end-position)))))

  (defun will/contains-delimiter (arg)
    (-first
     (lambda (head)
       (-contains? will/tab-out-delimiters head))
     (split-string arg "")))

  (defun will/line-contains-delimeter (arg)
    (interactive "P")
    (will/contains-delimiter (will/get-line-from-cursor nil)))

  (defun will/tab-out (arg)
    "Jump out of a parenthetical."
    (interactive "P")
    (let ((str (will/line-contains-delimeter nil)))
      (if str
          (search-forward str)
        (will/tab-fallback))))

  (defun will/tab-fallback ()
    "Fallback behavior of `will/exit-parens`."
    (let ((fallback-behavior (will/tab-original-keybinding)))
      (if fallback-behavior
          (call-interactively fallback-behavior))))

  (defun will/tab-original-keybinding ()
    "Get current keys' binding as if `will/exit-parens` didn't exist."
    ;; Copied from tab-jump-out package
    (let* ((will/tab-out-mode nil)
           (keys (this-single-command-keys)))
      (or (key-binding keys t)
          (key-binding (will/tab-out--fallback-translate-input keys) t))))

  (defun will/tab-out--fallback-translate-input (keys)
    ;; Copied from tab-jump-out package
    (let ((retval [])
          (i 0))
      (while (< i (length keys))
        (let ((j i)
              (translated local-function-key-map))
          (while (and (< j (length keys))
                      translated
                      (keymapp translated))
            (setq translated (cdr (assoc (aref keys j) (remove 'keymap translated)))
                  j (1+ j)))
          (setq retval (vconcat retval (cond ((symbolp translated)
                                              `[,translated])
                                             ((vectorp translated)
                                              translated)
                                             (t
                                              (substring keys i j)))))
          (setq i j)))
      retval))

  (defgroup will/tab-out nil
    "Custom group for `will/tab-out-mode`."
    :group 'editing
    :prefix "will/tab-out-")

  (defvar will/tab-out-mode-map
    (let ((map (make-sparse-keymap)))
      (define-key map [tab] 'will/tab-out)
      map)
    "Keymap for `will/tab-out`.")

  (define-minor-mode will/tab-out-mode
    "A minor mode that allows you to jump out of parentheticals with tab."
    :keymap will/tab-out-mode-map
    :global t)

  ;; (will/tab-out-mode 1)
  ;; (add-hook 'minibuffer-setup-hook (lambda () (will/tab-out-mode -1)))
  ;; (add-hook 'minibuffer-exit-hook (lambda () (will/tab-out-mode 1)))
#+end_src

* Tangle on save
THIS MUST BE THE LAST PART OF THE FILE IN ORDER TO WORK

;; Local Variables:
;; eval: (add-hook 'after-save-hook (lambda () (if (y-or-n-p "Tangle?")(org-babel-tangle))) nil t)
;; End:
